/*7. В една аптека всяко лекарство (наименование, цена, срок на годност) е доставено от доставчик (име, адрес,
телефон) от производител (име, адрес, телефон) или от вносител (име, адрес, телефон). Данните за всяко лекарство,
неговия доставчик и производител/вносител се съхраняват в масив.
Да се състави програма, която изпълнява от меню следните операции:
- добавя към масива данните на ново лекарство;
- извежда всички въведени данни;
- извежда данните за лекарствата с цена под 10 лева, доставени от посочен производител;
- създава масив с данните за лекарствата, внесени от посочен вносител;
- създава масив с данните на всички вносители.*/
#include<iostream>
#include<stdlib.h>
#include<string>
#include"CMedicine.h"
using namespace std;

int main() {
	CMedicine M1;
	M1.addNewMed();
	M1.displayAllData();
}